#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.rsa_key: Refreshing state... [id=413b87d849ea87de5ee44b9a5cad69ae2e475767]
local_file.tfkey: Refreshing state... [id=0c3b9b1600e410c231c9c20a0d7246da030f24d4]
data.aws_ami.java-ami: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0ced2edb099693e36]
aws_eip.nat_gateway: Refreshing state... [id=eipalloc-09c8adbcd0a59159e]
aws_key_pair.terraform_key: Refreshing state... [id=terraform_key]
data.aws_ami.java-ami: Read complete after 0s [id=ami-0b8e77b59a2530a47]
aws_subnet.privatesubnet_1: Refreshing state... [id=subnet-0a7ba867cd5df52f7]
aws_subnet.publicsubnet_1: Refreshing state... [id=subnet-0caf592e5e9cb7ca6]
aws_security_group.allow_ssh: Refreshing state... [id=sg-074ce032582b08d2e]
aws_subnet.privatesubnet_2: Refreshing state... [id=subnet-0dd37c003b0c00ba5]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-06eba762ad70a7fa1]
aws_subnet.publicsubnet_2: Refreshing state... [id=subnet-0d0c63dfd1a4bb7b6]
aws_security_group.allow_http: Refreshing state... [id=sg-0819e65d2c1ec53d4]
aws_security_group.elb: Refreshing state... [id=sg-01396052a56f8ecbb]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-04cf0891a2890e0b5]
aws_instance.bastion-host: Refreshing state... [id=i-05f7cb180fa2c845d]
aws_launch_template.ec2_config: Refreshing state... [id=lt-0f341c0d5ae5fb7da]
aws_route_table.public_route_table: Refreshing state... [id=rtb-0e8af714e855d9b27]
aws_elb.elastic-load-balancer: Refreshing state... [id=ELB]
aws_route_table.private_route_table: Refreshing state... [id=rtb-02fd6e1ce256973f6]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0ec9d928e3deb165f]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0702230adef350905]
aws_autoscaling_group.auto_scaling_group: Refreshing state... [id=Auto Scaling Group]
aws_route_table_association.public_route_table_association_2: Refreshing state... [id=rtbassoc-0aa553678527d4027]
aws_route_table_association.public_route_table_association_1: Refreshing state... [id=rtbassoc-008e381325566234c]
aws_autoscaling_attachment.asg_attachment: Refreshing state... [id=Auto Scaling Group-20230202170013719000000006]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment will be created
  + resource "aws_autoscaling_attachment" "asg_attachment" {
      + autoscaling_group_name = "Auto Scaling Group"
      + elb                    = "ELB"
      + id                     = (known after apply)
    }

  # aws_db_instance.postgres-db will be created
  + resource "aws_db_instance" "postgres-db" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "postgresdb"
      + db_subnet_group_name                  = "db-subnet-group"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.4"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = [
          + "sg-074ce032582b08d2e",
          + "sg-0819e65d2c1ec53d4",
        ]
    }

  # aws_db_subnet_group.db-subnet-group will be created
  + resource "aws_db_subnet_group" "db-subnet-group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0a7ba867cd5df52f7",
          + "subnet-0dd37c003b0c00ba5",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "db-subnet-group"
        }
      + tags_all                = {
          + "Name" = "db-subnet-group"
        }
    }

  # local_file.tfkey will be created
  + resource "local_file" "tfkey" {
      + content              = (sensitive value)
      + directory_permission = "0777"
      + file_permission      = "400"
      + filename             = "tfkey"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @ludicsa, Action: `pull_request`*